In [2]:
!pip install psycopg2-binary pandas

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.12/site-packages (2.9.11)
Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
import psycopg2
from psycopg2.extras import RealDictCursor
import pandas as pd

In [6]:
def get_connection():
    return psycopg2.connect(
        host="dpg-d4ltqca4d50c73e9pu8g-a.oregon-postgres.render.com",
        database="mini_project_2_ga5e",
        user="mini_project_2_ga5e_user",
        password="n1JnTZoEbDnU982DU5aVpWwQl2EJXlF4",
        port=5432,
        sslmode="require",
        cursor_factory=RealDictCursor
    )

conn = get_connection()
cursor = conn.cursor()

print("Connected successfully!")

Connected successfully!

In [8]:
QUERIES = {
    "ex1: All Regions":
        "SELECT * FROM Region LIMIT 20;",

    "ex2: Customer Total Sales":
        """
        SELECT 
            C.FirstName || ' ' || C.LastName AS Name,
            SUM(P.ProductUnitPrice * OD.QuantityOrdered)::numeric(10,2) AS Total
        FROM OrderDetail OD
        JOIN Customer C ON OD.CustomerID = C.CustomerID
        JOIN Product P ON OD.ProductID = P.ProductID
        GROUP BY Name
        ORDER BY Total DESC
        LIMIT 10;
        """,

    "ex3: Top 10 Products by Sales":
        """
        SELECT 
            P.ProductName,
            SUM(OD.QuantityOrdered) AS TotalUnits
        FROM OrderDetail OD
        JOIN Product P ON OD.ProductID = P.ProductID
        GROUP BY P.ProductName
        ORDER BY TotalUnits DESC
        LIMIT 10;
        """,

    "ex4: Customers per Country":
        """
        SELECT 
            Ctry.Country,
            COUNT(*) AS NumCustomers
        FROM Customer Cust
        JOIN Country Ctry ON Cust.CountryID = Ctry.CountryID
        GROUP BY Ctry.Country
        ORDER BY NumCustomers DESC;
        """,

    "ex5: Orders per Day":
        """
        SELECT 
            OrderDate,
            COUNT(*) AS NumOrders
        FROM OrderDetail
        GROUP BY OrderDate
        ORDER BY OrderDate;
        """,

    "ex6: Total Revenue":
        """
        SELECT 
            SUM(P.ProductUnitPrice * OD.QuantityOrdered)::numeric(12,2) AS Revenue
        FROM OrderDetail OD
        JOIN Product P ON OD.ProductID = P.ProductID;
        """,

    "ex7: Product Categories Total Units":
        """
        SELECT 
            PC.ProductCategory,
            SUM(OD.QuantityOrdered) AS UnitsSold
        FROM OrderDetail OD
        JOIN Product P ON OD.ProductID = P.ProductID
        JOIN ProductCategory PC ON P.ProductCategoryID = PC.ProductCategoryID
        GROUP BY PC.ProductCategory
        ORDER BY UnitsSold DESC;
        """,

    "ex8: Last 20 Orders":
        "SELECT * FROM OrderDetail ORDER BY OrderID DESC LIMIT 20;",

    "ex9: Customers with > 20 Orders":
        """
        SELECT 
            C.FirstName || ' ' || C.LastName AS Name,
            COUNT(*) AS NumOrders
        FROM OrderDetail OD
        JOIN Customer C ON OD.CustomerID = C.CustomerID
        GROUP BY Name
        HAVING COUNT(*) > 20
        ORDER BY NumOrders DESC;
        """,

    "ex10: Average Product Price per Category":
        """
        SELECT 
            PC.ProductCategory,
            AVG(P.ProductUnitPrice)::numeric(10,2) AS AvgPrice
        FROM Product P
        JOIN ProductCategory PC ON P.ProductCategoryID = PC.ProductCategoryID
        GROUP BY PC.ProductCategory;
        """,

    "ex11: Top Customers by Revenue":
        """
        SELECT
            C.FirstName || ' ' || C.LastName AS Name,
            SUM(P.ProductUnitPrice * OD.QuantityOrdered)::numeric(12,2) AS Revenue
        FROM OrderDetail OD
        JOIN Customer C ON OD.CustomerID = C.CustomerID
        JOIN Product P ON OD.ProductID = P.ProductID
        GROUP BY Name
        ORDER BY Revenue DESC
        LIMIT 10;
        """
}

In [10]:
def run_query(sql):
    cursor.execute(sql)
    rows = cursor.fetchall()
    df = pd.DataFrame(rows)
    return df

In [12]:
for title, sql in QUERIES.items():
    print("="*80)
    print(title)
    print("="*80)
    print(sql)
    
    try:
        df = run_query(sql)
        display(df)
    except Exception as e:
        print(f"Error running query: {e}")
    
    print("\n\n")

================================================================================
ex1: All Regions
================================================================================
SELECT * FROM Region LIMIT 20;

   regionid           region
0         1    British Isles
1         2  Central America
2         3   Eastern Europe
3         4    North America
4         5  Northern Europe
5         6      Scandinavia
6         7    South America
7         8  Southern Europe
8         9   Western Europe

================================================================================
ex2: Customer Total Sales
================================================================================

        SELECT
            C.FirstName || ' ' || C.LastName AS Name,
            SUM(P.ProductUnitPrice * OD.QuantityOrdered)::numeric(10,2) AS Total
        FROM OrderDetail OD
        JOIN Customer C ON OD.CustomerID = C.CustomerID
        JOIN Product P ON OD.ProductID = P.ProductID
        GROUP BY Name
        ORDER BY Total DESC
        LIMIT 10;

                 name       total
0      Annette Roulet  6092806.79
1      Manuel Pereira  5905784.45
2      Janete Limeira  5817785.32
3  Christina Berglund  5679042.68
4           Liz Nixon  5623333.51
5          John Steel  5585858.39
6        Paul Henriot  5584530.02
7       Rene Phillips  5565819.72
8   Anabela Domingues  5539991.05
9       Martine Rance  5421252.67

================================================================================
ex3: Top 10 Products by Sales
================================================================================

        SELECT
            P.ProductName,
            SUM(OD.QuantityOrdered) AS TotalUnits
        FROM OrderDetail OD
        JOIN Product P ON OD.ProductID = P.ProductID
        GROUP BY P.ProductName
        ORDER BY TotalUnits DESC
        LIMIT 10;

               productname  totalunits
0            Longlife Tofu      210219
1            Aniseed Syrup      209901
2             Vegie-spread      209875
3                Spegesild      209596
4                    Chang      209398
5   Escargots de Bourgogne      209348
6    Manjimup Dried Apples      209216
7              Flotemysost      209123
8           Steeleye Stout      209009
9  Thuringer Rostbratwurst      208449

================================================================================
ex4: Customers per Country
================================================================================

        SELECT
            Ctry.Country,
            COUNT(*) AS NumCustomers
        FROM Customer Cust
        JOIN Country Ctry ON Cust.CountryID = Ctry.CountryID
        GROUP BY Ctry.Country
        ORDER BY NumCustomers DESC;

        country  numcustomers
0           USA            13
1       Germany            11
2        France            11
3        Brazil             9
4            UK             7
5         Spain             5
6        Mexico             5
7     Venezuela             4
8         Italy             3
9        Canada             3
10    Argentina             3
11      Denmark             2
12  Switzerland             2
13      Finland             2
14      Belgium             2
15       Sweden             2
16     Portugal             2
17      Austria             2
18       Norway             1
19       Poland             1
20      Ireland             1

================================================================================
ex5: Orders per Day
================================================================================

        SELECT
            OrderDate,
            COUNT(*) AS NumOrders
        FROM OrderDetail
        GROUP BY OrderDate
        ORDER BY OrderDate;

       orderdate  numorders
0     2012-07-04          3
1     2012-07-05          2
2     2012-07-08          6
3     2012-07-09          3
4     2012-07-10        347
...          ...        ...
1319  2016-02-15        498
1320  2016-02-16        397
1321  2016-02-17        586
1322  2016-02-18        276
1323  2016-02-19        451

[1324 rows x 2 columns]

================================================================================
ex6: Total Revenue
================================================================================

        SELECT
            SUM(P.ProductUnitPrice * OD.QuantityOrdered)::numeric(12,2) AS Revenue
        FROM OrderDetail OD
        JOIN Product P ON OD.ProductID = P.ProductID;

        revenue
0  458003714.33

================================================================================
ex7: Product Categories Total Units
================================================================================

        SELECT
            PC.ProductCategory,
            SUM(OD.QuantityOrdered) AS UnitsSold
        FROM OrderDetail OD
        JOIN Product P ON OD.ProductID = P.ProductID
        JOIN ProductCategory PC ON P.ProductCategoryID = PC.ProductCategoryID
        GROUP BY PC.ProductCategory
        ORDER BY UnitsSold DESC;

  productcategory  unitssold
0     Confections    2678905
1      Condiments    2470590
2         Seafood    2469965
3       Beverages    2467443
4  Dairy Products    2063933
5  Grains/Cereals    1433467
6    Meat/Poultry    1237100
7         Produce    1032508

================================================================================
ex8: Last 20 Orders
================================================================================
SELECT * FROM OrderDetail ORDER BY OrderID DESC LIMIT 20;

    orderid  customerid  productid   orderdate  quantityordered
0    621806          91         48  2012-11-23               11
1    621805          91         24  2012-11-23                3
2    621804          91         29  2012-11-23                6
3    621803          91         58  2012-11-23               12
4    621802          91          1  2012-11-23               13
5    621801          91         63  2012-11-23               45
6    621800          91         69  2012-11-23               37
7    621799          91         61  2012-11-23               37
8    621798          91         65  2012-11-23                4
9    621797          91         70  2012-11-23               21
10   621796          91         17  2012-11-23               13
11   621795          91         45  2012-11-23               27
12   621794          91         63  2014-06-08                7
13   621793          91         55  2014-06-08               30
14   621792          91         68  2014-06-08               37
15   621791          91         54  2014-06-08               29
16   621790          91         52  2014-06-08               30
17   621789          91         46  2014-06-08                9
18   621788          91         26  2014-06-08               17
19   621787          91         77  2014-06-08                8

================================================================================
ex9: Customers with > 20 Orders
================================================================================

        SELECT
            C.FirstName || ' ' || C.LastName AS Name,
            COUNT(*) AS NumOrders
        FROM OrderDetail OD
        JOIN Customer C ON OD.CustomerID = C.CustomerID
        GROUP BY Name
        HAVING COUNT(*) > 20
        ORDER BY NumOrders DESC;

                  name  numorders
0       Annette Roulet       8304
1       Manuel Pereira       8048
2       Janete Limeira       7749
3   Christina Berglund       7736
4            Liz Nixon       7590
..                 ...        ...
86       Martin Sommer       6084
87        Thomas Hardy       6055
88    Patricia McKenna       6019
89  Frederique Citeaux       5267
90      Helvetius Nagy       5223

[91 rows x 2 columns]

================================================================================
ex10: Average Product Price per Category
================================================================================

        SELECT
            PC.ProductCategory,
            AVG(P.ProductUnitPrice)::numeric(10,2) AS AvgPrice
        FROM Product P
        JOIN ProductCategory PC ON P.ProductCategoryID = PC.ProductCategoryID
        GROUP BY PC.ProductCategory;

  productcategory avgprice
0       Beverages    37.98
1         Produce    32.37
2      Condiments    23.06
3  Grains/Cereals    20.25
4    Meat/Poultry    54.01
5     Confections    25.16
6  Dairy Products    28.73
7         Seafood    20.68

================================================================================
ex11: Top Customers by Revenue
================================================================================

        SELECT
            C.FirstName || ' ' || C.LastName AS Name,
            SUM(P.ProductUnitPrice * OD.QuantityOrdered)::numeric(12,2) AS Revenue
        FROM OrderDetail OD
        JOIN Customer C ON OD.CustomerID = C.CustomerID
        JOIN Product P ON OD.ProductID = P.ProductID
        GROUP BY Name
        ORDER BY Revenue DESC
        LIMIT 10;

                 name     revenue
0      Annette Roulet  6092806.79
1      Manuel Pereira  5905784.45
2      Janete Limeira  5817785.32
3  Christina Berglund  5679042.68
4           Liz Nixon  5623333.51
5          John Steel  5585858.39
6        Paul Henriot  5584530.02
7       Rene Phillips  5565819.72
8   Anabela Domingues  5539991.05
9       Martine Rance  5421252.67